# ytop
tap "cjbassi/ytop"
# age
tap "filippo.io/age", "https://filippo.io/age"
# gh
tap "github/gh"
# golangci-lint
tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
# act, local GitHub actions
tap "nektos/tap"

brew "age"
brew "awscli"
brew "bat"
brew "black"
brew "brew-cask-completion"
brew "closure-compiler"
brew "coreutils"
brew "ctags"
brew "curl"
brew "dfu-programmer"
brew "dfu-util"
brew "dialog"
brew "diff-so-fancy"
brew "docker-compose"
brew "dust"
brew "fd"
brew "ffmpeg"
brew "ffsend"
brew "findutils"
brew "fzf"
brew "gcc"
brew "git"
brew "github/gh/gh"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "grip"
brew "htop"
brew "httpie"
brew "httpstat"
brew "icdiff"
brew "imagemagick"
brew "jq"
brew "lsd"
brew "magic-wormhole"
brew "make"
brew "moreutils"
brew "nektos/tap/act"
brew "node"
brew "perl"
brew "python"
brew "ripgrep"
brew "rsync-time-backup"
brew "rust"
brew "shellcheck"
brew "speedtest-cli"
brew "sqlite"
brew "starship"
brew "tmux"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "ykman"
brew "ykpers"
brew "youtube-dl"
brew "ytop"
brew "zsh"
if OS.linux?
    brew "strace"
end
if OS.mac?
    brew "hopenpgp-tools"
    brew "pinentry-mac"
end

cask "1password"
cask "alfred"
cask "appcleaner"
cask "bartender"
cask "battle-net"
cask "brave-browser-nightly"
cask "font-jetbrains-mono"
cask "contexts"
cask "dash"
cask "discord"
cask "docker"
cask "fing"
cask "finicky"
cask "github"
cask "goland"
cask "iina"
cask "iterm2"
cask "local"
cask "mullvadvpn"
cask "notion"
cask "postman"
cask "sequel-pro-nightly"
cask "signal"
cask "slack"
cask "spectacle"
cask "spotify"
cask "sqlpro-for-sqlite"
cask "the-unarchiver"
cask "transmission"
cask "tunnelblick"
cask "visual-studio-code"
cask "whatsapp"
cask "zoomus"

