tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"

brew "awscli"
brew "brew-cask-completion"
brew "coreutils"
brew "ctags"
brew "curl"
brew "dfu-programmer"
brew "dfu-util"
brew "dialog"
brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "gcc"
brew "git"
brew "github/gh/gh"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "hopenpgp-tools"
brew "htop"
brew "imagemagick"
brew "jq"
brew "moreutils"
brew "node"
brew "perl"
brew "pinentry-mac"
brew "python"
brew "ripgrep"
brew "shellcheck"
brew "sqlite"
brew "tmux"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "yarn"
brew "ykman"
brew "ykpers"
brew "youtube-dl"
brew "zsh"

cask "1password"
cask "alfred"
cask "appcleaner"
cask "battle-net"
cask "contexts"
cask "discord"
cask "docker"
cask "fing"
cask "goland"
cask "google-chrome-dev"
cask "iina"
cask "iterm2"
cask "local"
cask "mullvadvpn"
cask "notion"
cask "postman"
cask "signal"
cask "slack"
cask "spectacle"
cask "spotify"
cask "transmission"
cask "tunnelblick"
cask "visual-studio-code"
cask "whatsapp"
